#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//操作符（2）+指针（1）

//下标访问[] ,函数使用()
int main()
{
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };

	printf("%d\n", arr[5]);//[]下标引用操作符
	//[] 操作数是：arr  5

	return 0;
}


//函数调用操作符
int add(int x, int y)
{
	return x + y;
}

int main()
{
	int ret = add(2, 3);//()函数调用操作符
	//()操作数是：add 2 3
	//至少有一个操作数
	return 0;
}

//sizeof 不是函数，是操作符
int mian()
{
	int a = 0;
	
	int n = sizeof(int);

	int n = sizeof a;

	return 0;
}


//操作符的属性：优先级，结合性
//https://zh.cppreference.com/w/c/language/operator_precedence

int main()
{
	//相邻操作符
	int a = 1 + 2 * 3;//优先级
	int b = 1 + 2 + 3;//优先级相同看结合性：从左向右（少数从右向左）

	return 0;
}


//表达式求值
//表达式求值之前要进行类型转换：整型提升  算数转换

//整型提升  
//有符号整数提升是按照变量的数据类型的符号位来提升的
//无符号整数，高位直接补0
int main()
{
	//char  -signed char

	char a = 5;
	//5-int-4个字节-32bit
	//00000000000000000000000000000101
	//00000101  - a   截断后存储到a中
   
	char b = 127;
	//00000000000000000000000001111111
	//01111111  - b   截断后存储到b中
	
	char c = a + b;//发生整型提升
	//00000000000000000000000000000101  - a
	//00000000000000000000000001111111  - b 
	//00000000000000000000000010000100  - a+b
	//10000100  - c

	printf("%d\n", c);
	//%d 是按照10进制的形式打印有符号的整数
	//整型提升
	//11111111111111111111111110000100  原码
	//10000000000000000000000001111011  反码
	//10000000000000000000000001111100  补码
	//-124

	return 0;
}


//算数转换


//问题表达式
//通过操作符的属性，无法确定表达式的唯一计算路径
//...




//指针

//内存
//把内存划分一个个的内存单元，每个内存单元的大小取1个字节
//（单位换算）
//内存单元的编号==地址==指针


int main()
{
	int a = 10;

	printf("%p\n", &a);

	int* ptr = &a;//指针变量
	
	*ptr = 0;//*解引用操作符/间接访问操作符
	printf("%d\n", a);

	return 0;
}

